Exercises
Using the titanic data, in your classification-exercises repository, create a notebook, model.ipynb where you will do the following:

What is your baseline prediction? What is your baseline accuracy? 
remember: your baseline prediction for a classification problem is predicting the most prevelant class in the training dataset (the mode). 
When you make those predictions, what is your accuracy? This is your baseline accuracy.

In [1]:

import numpy as np
import pandas as pd
import warnings
warnings.filterwarnings('ignore')

In [35]:
import acquire
import prepare
# grab Decision Tree Classifier and some helping friends from sklearn.tree
from sklearn.tree import DecisionTreeClassifier, plot_tree, export_text
# get classification report for model assessment
from sklearn.metrics import classification_report
from matplotlib import pyplot as plt

In [3]:
titanic_db=pd.read_csv('titanic_db')

In [4]:
titanic_db.head()

,Unnamed: 0,passenger_id,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,deck,embark_town,alone
0,0,0,0,3,male,22.0,1,0,7.2500,S,Third,NaN,Southampton,0
1,1,1,1,1,female,38.0,1,0,71.2833,C,First,C,Cherbourg,0
2,2,2,1,3,female,26.0,0,0,7.9250,S,Third,NaN,Southampton,1
3,3,3,1,1,female,35.0,1,0,53.1000,S,First,C,Southampton,0
4,4,4,0,3,male,35.0,0,0,8.0500,S,Third,NaN,Southampton,1

In [6]:
titanic_db.survived.mode()

0    0
Name: survived, dtype: int64

this is my baseline accuracy. my baseline prediction is "not survived"

In [9]:
(1-titanic_db.survived.mean()) *100

61.61616161616161

2) Fit the decision tree classifier to your training sample and transform (i.e. make predictions on the training sample)

In [5]:
titanic_db=prepare.prep_titanic(titanic_db)

In [6]:
titanic_db

,Unnamed: 0,passenger_id,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,0,3,1,0,7.2500,0,1,0,1
1,1,1,1,1,1,0,71.2833,0,0,0,0
2,2,2,1,3,0,0,7.9250,1,0,0,1
3,3,3,1,1,1,0,53.1000,0,0,0,1
4,4,4,0,3,0,0,8.0500,1,1,0,1
...,...,...,...,...,...,...,...,...,...,...,...
886,886,886,0,2,0,0,13.0000,1,1,0,1
887,887,887,1,1,0,0,30.0000,1,0,0,1
888,888,888,0,3,1,2,23.4500,0,0,0,1
889,889,889,1,1,0,0,30.0000,1,1,0,0
890,890,890,0,3,0,0,7.7500,1,1,1,0

In [13]:
train,validate,test=prepare.my_train_test_split(titanic_db,'survived')

In [14]:
train.head()

,Unnamed: 0,passenger_id,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
455,455,455,1,3,0,0,7.8958,1,1,0,0
380,380,380,1,1,0,0,227.5250,1,0,0,0
492,492,492,0,1,0,0,30.5000,1,1,0,1
55,55,55,1,1,0,0,35.5000,1,1,0,1
243,243,243,0,3,0,0,7.1250,1,1,0,1

In [15]:
X_train = train.drop(columns=['survived'])
y_train = train.survived

X_validate = validate.drop(columns=['survived'])
y_validate = validate.survived

X_test = test.drop(columns=['survived'])
y_test = test.survived

In [16]:
X_train.head()

,Unnamed: 0,passenger_id,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
455,455,455,3,0,0,7.8958,1,1,0,0
380,380,380,1,0,0,227.5250,1,0,0,0
492,492,492,1,0,0,30.5000,1,1,0,1
55,55,55,1,0,0,35.5000,1,1,0,1
243,243,243,3,0,0,7.1250,1,1,0,1

In [17]:
y_train.head()

455    1
380    1
492    0
55     1
243    0
Name: survived, dtype: int64

In [18]:
clf=DecisionTreeClassifier(max_depth=3, random_state=123)

In [19]:
clf

DecisionTreeClassifier(max_depth=3, random_state=123)

In [20]:
clf= clf.fit(X_train, y_train)

DecisionTreeClassifier(max_depth=3, random_state=123)

In [49]:
plt.figure(figsize=(13, 7))
plot_tree(clf, feature_names=X_train.columns.str(), class_names=clf.classes_, rounded=True)

AttributeError: 'StringMethods' object has no attribute 'str'

In [31]:
y_pred= clf.predict(X_train)

In [32]:
y_pred

array([0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 0, 0, 1,
       0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 0, 0, 1, 1,
       0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 0, 1,
       0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0,
       0, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 1,
       0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 0, 0, 0,
       0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 1,
       1, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 1, 0, 1, 1, 0, 1, 0, 0, 1,
       1, 1, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 0, 1, 1, 1, 0,
       1, 0, 0, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0,
       1, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1,
       1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0, 0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0,
       1, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1,
       1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1,
       0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0,
       0, 0, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0, 1, 0, 1, 1, 0, 0, 0, 0,
       0, 1, 1, 0, 1, 0, 1, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 0, 0, 1, 0,
       0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 0, 0, 0,
       0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 1, 0, 1, 0, 0, 1, 0, 0,
       0, 0, 1, 0, 0, 1])

In [33]:
y_pred_proba = clf.predict_proba(X_train)
y_pred_proba[0:5]

array([[0.90322581, 0.09677419],
       [0.        , 1.        ],
       [0.61458333, 0.38541667],
       [0.86666667, 0.13333333],
       [0.90322581, 0.09677419]])

In [34]:
print('Accuracy of Decision Tree classifier on training set: {:.2f}'
      .format(clf.score(X_train, y_train)))

Accuracy of Decision Tree classifier on training set: 0.81

Exercises
Continue working in your model file with titanic data to do the following:

1)Fit the Random Forest classifier to your training sample and transform (i.e. make predictions on the training sample) 
setting the random_state accordingly and setting min_samples_leaf = 1 and max_depth = 10.

In [41]:
import numpy as np

from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix


import matplotlib.pyplot as plt

import seaborn as sns


from pydataset import data

In [44]:
titanic_db.head()

,Unnamed: 0,passenger_id,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,0,0,3,1,0,7.2500,0,1,0,1
1,1,1,1,1,1,0,71.2833,0,0,0,0
2,2,2,1,3,0,0,7.9250,1,0,0,1
3,3,3,1,1,1,0,53.1000,0,0,0,1
4,4,4,0,3,0,0,8.0500,1,1,0,1

In [46]:
titanic_db=titanic_db.drop(['Unnamed: 0','passenger_id'], axis=1)

In [47]:
titanic_db

,survived,pclass,sibsp,parch,fare,alone,sex_male,embark_town_Queenstown,embark_town_Southampton
0,0,3,1,0,7.2500,0,1,0,1
1,1,1,1,0,71.2833,0,0,0,0
2,1,3,0,0,7.9250,1,0,0,1
3,1,1,1,0,53.1000,0,0,0,1
4,0,3,0,0,8.0500,1,1,0,1
...,...,...,...,...,...,...,...,...,...
886,0,2,0,0,13.0000,1,1,0,1
887,1,1,0,0,30.0000,1,0,0,1
888,0,3,1,2,23.4500,0,0,0,1
889,1,1,0,0,30.0000,1,1,0,0
890,0,3,0,0,7.7500,1,1,1,0